---
kind: method
id: M:Autodesk.Revit.DB.Outline.IsScaleValid(System.Double)
source: html/6d5c1fa3-8b4d-4cd8-7730-62df951bc03d.htm
---
# Autodesk.Revit.DB.Outline.IsScaleValid Method

Checks if given scale is valid. Should be greater than zero.

## Syntax (C#)
```csharp
public bool IsScaleValid(
	double scale
)
```

## Parameters
- **scale** (`System.Double`) - The scale.

## Returns
True if the scale is valid, false otherwise.